Revit 2027 API
FloorType.StructuralMaterialId Property
 Returns the identifier of the material that defines the element's structural analysis properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId StructuralMaterialId { get; set; }
Public Property StructuralMaterialId As ElementId
	Get
	Set
public:
property ElementId^ StructuralMaterialId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member StructuralMaterialId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property: the floor does not have a structural material
See Also
Reference
FloorType Class
Autodesk.Revit.DB Namespace